//
//  Item.swift
//  Assignment1-SwiftUI
//
//  Created by Ana on 5/23/24.
//

import Foundation

struct Item: Identifiable {
    let id = UUID()
    let question: String
    let answer: String
}

let data = [
    Item(question: "რა დაუწუნა ბარბარემ ნიკის?", answer: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"),
    Item(question: "რა ზომის ფეხი აქვს ვასოს?", answer: "დეველოპერებმა განაცხადეს რომ თუ მას 42 და მეტი ზომა ფეხი აქვს მის მოსმენას აზრი არ აქვს და კომენტარის გარეშე დატოვებენ ლექციას"),
    Item(question: "რა სიმაღლისაა ანჟელა ew?", answer: "ანჟელა ew არის მეტრაოთხმოცი, რაც ნიშნავს რომ ის დაახლოებით ტეილორ Swift-ის სიმაღლისაა და დიდი ფეხი აქვს"),
    Item(question: "რატომ გაებუტა ბარბარეს ჭეპეტე?", answer: "ამჟამინდელი მონაცემებით ისინი 2 დღე არ ესაუბრებოდნენ ერთმანეთს და როგორც გაირკვა ანიგნორებს აიგნორებდნენ რაღაც იგნორში."),
    Item(question: "MVC vs MVVM", answer: "აი ეს MVC გასაგებია, მაგრამ MVVM ჩემამდე არ დადის რა, ამ სვიბთ იუაიში სად ვიყენებთ მაგას?"),
    Item(question: "ნეტავ რამდენი ხანი გაგრძელდება ეს?", answer: "აღმოჩნდა რომ დეველოპერები ძალიან გახარებულები არიან SwiftUI-ით. ნეტავ რამდენი ხანი გაგრძელდება Honeymoon phase?"),
    Item(question: "რა დაუწუნა ბარბარემ ნიკის?", answer: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"),
    Item(question: "რა ზომის ფეხი აქვს ვასოს?", answer: "დეველოპერებმა განაცხადეს რომ თუ მას 42 და მეტი ზომა ფეხი აქვს მის მოსმენას აზრი არ აქვს და კომენტარის გარეშე დატოვებენ ლექციას"),
    Item(question: "რა სიმაღლისაა ანჟელა ew?", answer: "ანჟელა ew არის მეტრაოთხმოცი, რაც ნიშნავს რომ ის დაახლოებით ტეილორ Swift-ის სიმაღლისაა და დიდი ფეხი აქვს"),
    Item(question: "რატომ გაებუტა ბარბარეს ჭეპეტე?", answer: "ამჟამინდელი მონაცემებით ისინი 2 დღე არ ესაუბრებოდნენ ერთმანეთს და როგორც გაირკვა ანიგნორებს აიგნორებდნენ რაღაც იგნორში."),
    Item(question: "MVC vs MVVM", answer: "აი ეს MVC გასაგებია, მაგრამ MVVM ჩემამდე არ დადის რა, ამ სვიბთ იუაიში სად ვიყენებთ მაგას?"),
    Item(question: "ნეტავ რამდენი ხანი გაგრძელდება ეს?", answer: "აღმოჩნდა რომ დეველოპერები ძალიან გახარებულები არიან SwiftUI-ით. ნეტავ რამდენი ხანი გაგრძელდება Honeymoon phase?")
]
